package by.htp.home01.main;

/*
 * 9. Вычислить значение выражения по формуле (все переменные принимают действительные значения):
 */

public class Task09 {

	public static void main(String[] args) {
		
		double a;
		double b;
		double c;
		double d;
		
		double e;
		
		a = 2;
		b = 5;
		c = 8;
		d = 13;
		
		e = (a / c) * (b / d) - ((a * b - c) / (c * d));
		
		System.out.println(e);

	}

}
