package by.htp.home01.main;

/*
 * 7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
 */

public class Task07 {

	public static void main(String[] args) {
		
		int a;
		
		int p;
		
		a = 5;
		
		p = a * 2 * a;
		
		System.out.println(p);

	}

}
