package by.htp.home01.main2;

/*
 * 25. Написать программу — модель анализа пожарного датчика в помещении, которая выводит сообщение
«Пожароопасная ситуация », если температура в комнате превысила 60° С.
 */

public class Task25 {

	public static void main(String[] args) {

		int c = 60;

		if (c > 60) {
			System.out.println("«Пожароопасная ситуация»");
		}

	}

}
